balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18LF65K80.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF15EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF15EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0xff" edc:name="EID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SDFLC" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="SDFLC" edc:nzwidth="0x8" edc:por="---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLC" edc:desc="" edc:mask="0x1f" edc:name="FLC" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLC0" edc:desc="" edc:mask="0x1" edc:name="FLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLC1" edc:desc="" edc:mask="0x1" edc:name="FLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLC2" edc:desc="" edc:mask="0x1" edc:name="FLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLC3" edc:desc="" edc:mask="0x1" edc:name="FLC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLC4" edc:desc="" edc:mask="0x1" edc:name="FLC4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFBCON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXFBCON0" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F0BP" edc:desc="" edc:mask="0xf" edc:name="F0BP" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="F1BP" edc:desc="" edc:mask="0xf" edc:name="F1BP" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="F0BP_0" edc:desc="" edc:mask="0x1" edc:name="F0BP_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F0BP_1" edc:desc="" edc:mask="0x1" edc:name="F0BP_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F0BP_2" edc:desc="" edc:mask="0x1" edc:name="F0BP_2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F0BP_3" edc:desc="" edc:mask="0x1" edc:name="F0BP_3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F1BP_0" edc:desc="" edc:mask="0x1" edc:name="F1BP_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F1BP_1" edc:desc="" edc:mask="0x1" edc:name="F1BP_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F1BP_2" edc:desc="" edc:mask="0x1" edc:name="F1BP_2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F1BP_3" edc:desc="" edc:mask="0x1" edc:name="F1BP_3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFBCON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00010001" edc:name="RXFBCON1" edc:nzwidth="0x8" edc:por="00010001">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F2BP" edc:desc="" edc:mask="0xf" edc:name="F2BP" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="F3BP" edc:desc="" edc:mask="0xf" edc:name="F3BP" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="F2BP_0" edc:desc="" edc:mask="0x1" edc:name="F2BP_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F2BP_1" edc:desc="" edc:mask="0x1" edc:name="F2BP_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F2BP_2" edc:desc="" edc:mask="0x1" edc:name="F2BP_2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F2BP_3" edc:desc="" edc:mask="0x1" edc:name="F2BP_3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F3BP_0" edc:desc="" edc:mask="0x1" edc:name="F3BP_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F3BP_1" edc:desc="" edc:mask="0x1" edc:name="F3BP_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F3BP_2" edc:desc="" edc:mask="0x1" edc:name="F3BP_2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="F3BP_3" edc:desc="" edc:mask="0x1" edc:name="F3BP_3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
