balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18LF65K80.PIC
        <edc:SFRDef edc:access="rrrrr-rr" edc:cname="RXB1SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu0uu" edc:name="RXB1SIDL" edc:nzwidth="0x8" edc:por="xxxxx0xx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3" edc:name="EID" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7" edc:name="SID" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0"/>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="EDI16" edc:desc="" edc:mask="0x1" edc:name="EDI16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EDI17" edc:desc="" edc:mask="0x1" edc:name="EDI17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0xff" edc:name="EID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0xff" edc:name="EID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrrrrrr" edc:cname="RXB1DLC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0uuuuuuu" edc:name="RXB1DLC" edc:nzwidth="0x8" edc:por="0xxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC" edc:desc="" edc:mask="0xf" edc:name="DLC" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="RB" edc:desc="" edc:mask="0x3" edc:name="RB" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="RXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D0" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D0" edc:desc="" edc:mask="0xff" edc:name="RXB1D0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB1D00" edc:desc="" edc:mask="0x1" edc:name="RXB1D00" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D01" edc:desc="" edc:mask="0x1" edc:name="RXB1D01" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D02" edc:desc="" edc:mask="0x1" edc:name="RXB1D02" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D03" edc:desc="" edc:mask="0x1" edc:name="RXB1D03" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D04" edc:desc="" edc:mask="0x1" edc:name="RXB1D04" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D05" edc:desc="" edc:mask="0x1" edc:name="RXB1D05" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D06" edc:desc="" edc:mask="0x1" edc:name="RXB1D06" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D07" edc:desc="" edc:mask="0x1" edc:name="RXB1D07" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D1" edc:desc="" edc:mask="0xff" edc:name="RXB1D1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB1D10" edc:desc="" edc:mask="0x1" edc:name="RXB1D10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D11" edc:desc="" edc:mask="0x1" edc:name="RXB1D11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D12" edc:desc="" edc:mask="0x1" edc:name="RXB1D12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D13" edc:desc="" edc:mask="0x1" edc:name="RXB1D13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D14" edc:desc="" edc:mask="0x1" edc:name="RXB1D14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D15" edc:desc="" edc:mask="0x1" edc:name="RXB1D15" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D16" edc:desc="" edc:mask="0x1" edc:name="RXB1D16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D17" edc:desc="" edc:mask="0x1" edc:name="RXB1D17" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D2" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D2" edc:desc="" edc:mask="0xff" edc:name="RXB1D2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB1D20" edc:desc="" edc:mask="0x1" edc:name="RXB1D20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D21" edc:desc="" edc:mask="0x1" edc:name="RXB1D21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D22" edc:desc="" edc:mask="0x1" edc:name="RXB1D22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D23" edc:desc="" edc:mask="0x1" edc:name="RXB1D23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D24" edc:desc="" edc:mask="0x1" edc:name="RXB1D24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D25" edc:desc="" edc:mask="0x1" edc:name="RXB1D25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D26" edc:desc="" edc:mask="0x1" edc:name="RXB1D26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D27" edc:desc="" edc:mask="0x1" edc:name="RXB1D27" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D3" edc:desc="" edc:mask="0xff" edc:name="RXB1D3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB1D30" edc:desc="" edc:mask="0x1" edc:name="RXB1D30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D31" edc:desc="" edc:mask="0x1" edc:name="RXB1D31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D32" edc:desc="" edc:mask="0x1" edc:name="RXB1D32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D33" edc:desc="" edc:mask="0x1" edc:name="RXB1D33" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D34" edc:desc="" edc:mask="0x1" edc:name="RXB1D34" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D35" edc:desc="" edc:mask="0x1" edc:name="RXB1D35" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D36" edc:desc="" edc:mask="0x1" edc:name="RXB1D36" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D37" edc:desc="" edc:mask="0x1" edc:name="RXB1D37" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D4" edc:desc="" edc:mask="0xff" edc:name="RXB1D4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB1D40" edc:desc="" edc:mask="0x1" edc:name="RXB1D40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D41" edc:desc="" edc:mask="0x1" edc:name="RXB1D41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D42" edc:desc="" edc:mask="0x1" edc:name="RXB1D42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D43" edc:desc="" edc:mask="0x1" edc:name="RXB1D43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D44" edc:desc="" edc:mask="0x1" edc:name="RXB1D44" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D45" edc:desc="" edc:mask="0x1" edc:name="RXB1D45" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D46" edc:desc="" edc:mask="0x1" edc:name="RXB1D46" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D47" edc:desc="" edc:mask="0x1" edc:name="RXB1D47" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D5" edc:desc="" edc:mask="0xff" edc:name="RXB1D5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB1D50" edc:desc="" edc:mask="0x1" edc:name="RXB1D50" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D51" edc:desc="" edc:mask="0x1" edc:name="RXB1D51" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D52" edc:desc="" edc:mask="0x1" edc:name="RXB1D52" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D53" edc:desc="" edc:mask="0x1" edc:name="RXB1D53" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D54" edc:desc="" edc:mask="0x1" edc:name="RXB1D54" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D55" edc:desc="" edc:mask="0x1" edc:name="RXB1D55" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D56" edc:desc="" edc:mask="0x1" edc:name="RXB1D56" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D57" edc:desc="" edc:mask="0x1" edc:name="RXB1D57" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D6" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D6" edc:desc="" edc:mask="0xff" edc:name="RXB1D6" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB1D60" edc:desc="" edc:mask="0x1" edc:name="RXB1D60" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D61" edc:desc="" edc:mask="0x1" edc:name="RXB1D61" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D62" edc:desc="" edc:mask="0x1" edc:name="RXB1D62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D63" edc:desc="" edc:mask="0x1" edc:name="RXB1D63" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D64" edc:desc="" edc:mask="0x1" edc:name="RXB1D64" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D65" edc:desc="" edc:mask="0x1" edc:name="RXB1D65" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D66" edc:desc="" edc:mask="0x1" edc:name="RXB1D66" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D67" edc:desc="" edc:mask="0x1" edc:name="RXB1D67" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D7" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D7" edc:desc="" edc:mask="0xff" edc:name="RXB1D7" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB1D70" edc:desc="" edc:mask="0x1" edc:name="RXB1D70" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D71" edc:desc="" edc:mask="0x1" edc:name="RXB1D71" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D72" edc:desc="" edc:mask="0x1" edc:name="RXB1D72" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D73" edc:desc="" edc:mask="0x1" edc:name="RXB1D73" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D74" edc:desc="" edc:mask="0x1" edc:name="RXB1D74" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D75" edc:desc="" edc:mask="0x1" edc:name="RXB1D75" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D76" edc:desc="" edc:mask="0x1" edc:name="RXB1D76" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1D77" edc:desc="" edc:mask="0x1" edc:name="RXB1D77" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CANSTAT_RO0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANSTAT_RO0" edc:nzwidth="0x8" edc:por="10000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1/ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2/ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3/ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE" edc:desc="" edc:mask="0x7" edc:name="OPMODE" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1_ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2_ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3_ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE" edc:desc="" edc:mask="0x7" edc:name="OPMODE" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EICODE3" edc:desc="" edc:mask="0x1" edc:name="EICODE3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
